#include <iostream>


int main()
{
    system("chcp 1251"); // Установить кодировку
    //по условию 2 ряда по 6 мест
    int cutlery[2][6] = { 0 }; //столовые приборы
    int chairs[2][6] = { 0 }; //стулья
    int plates[2][6] = { 0 }; //тарелки

    for (int i = 0; i < 2; i++) { //внешний цикл по рядам (колонкам)
        for (int j = 0; j < 6; ++j) { //внутренний цикл по местам (рядам)
            //базовый набор 3 прибора, 2 тарелки, 1 стул
            cutlery[i][j] = 3;
            chairs[i][j] = 1;
            plates[i][j] = 2;

            if ((i == 0 && j == 0) || (i == 1 && j == 0)) { //вип во главе колонок
                cutlery[i][j]++; //+ложка
                plates[i][j]++; //+тарелка
            }
        }
    }
    chairs[0][4]++; //первый ряд 5 место (4 индекс) + стул для ребенка
    cutlery[1][2]--; //третье место (2 индекс) второго ряда - ложка
    cutlery[0][0]--; //- ложка у випа
    cutlery[1][2]++; //+ ложка у обворованного
    plates[0][0]--; //официант забрал ненужную тарелку у випа

    std::cout << "Итоговые данные:" << std::endl;
    std::cout << "Столовые приборы:" << std::endl;
    for (int i = 0; i < 2; ++i) {
        for (int j = 0; j < 6; ++j) {
            std::cout << "Место [" << i + 1 << ", " << j + 1 << "] : " << cutlery[i][j] << std::endl;
        }
    }

    std::cout << "\nТарелки:" << std::endl;
    for (int i = 0; i < 2; ++i) {
        for (int j = 0; j < 6; ++j) {
            std::cout << "Место [" << i + 1 << ", " << j + 1 << "] : " << plates[i][j] << std::endl;
        }
    }

    std::cout << "\nСтулья:" << std::endl;
    for (int i = 0; i < 2; ++i) {
        for (int j = 0; j < 6; ++j) {
            std::cout << "Место [" << i + 1 << ", " << j + 1 << "] : " << chairs[i][j] << std::endl;
        }
    }

}
